Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.6.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Cypress</vendor>
  <name>PSoC4_DFP</name>
  <description>Cypress PSoC 4 Device Support</description>
  <url>https://github.com/cypresssemiconductorco/cmsis-packs/raw/master/PSoC4_DFP/</url>
  <supportContact>https://www.cypress.com/support</supportContact>
  <license>APACHE_LICENSE.txt</license>
  <releases>
    <release version="1.0.0" date="2020-07-15">
      First Release version of PSoC® 4 Device Family Pack.
      Based on Cypress PSoC® 4 CMSIS Flash Loaders v2.0.0.25.
    </release>
  </releases>

  <keywords>
    <keyword>Cypress</keyword>
    <keyword>PSoC 4</keyword>
    <keyword>DFP</keyword>
  </keywords>

  <devices>
    <family Dfamily="PSoC 4000S" Dvendor="Cypress:19">
      <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000" />
      <description>
        PSoC 4000S devices.
      </description>
      <book name="README.txt" title="Cypress PSoC 4 DFP user guide"/>
      <device Dname="CY8C4024FNI-S402">
        <compile   define="CY8C4024FNI_S402" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQI-S401">
        <compile   define="CY8C4024LQI_S401" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQI-S402">
        <compile   define="CY8C4024LQI_S402" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024AZI-S403">
        <compile   define="CY8C4024AZI_S403" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024FNI-S412">
        <compile   define="CY8C4024FNI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQI-S411">
        <compile   define="CY8C4024LQI_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQI-S412">
        <compile   define="CY8C4024LQI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024AZI-S413">
        <compile   define="CY8C4024AZI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025FNI-S402">
        <compile   define="CY8C4025FNI_S402" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQI-S401">
        <compile   define="CY8C4025LQI_S401" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQI-S402">
        <compile   define="CY8C4025LQI_S402" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025AZI-S403">
        <compile   define="CY8C4025AZI_S403" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025FNI-S412">
        <compile   define="CY8C4025FNI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQI-S411">
        <compile   define="CY8C4025LQI_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
