Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4025LQI-S412">
        <compile   define="CY8C4025LQI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025AZI-S413">
        <compile   define="CY8C4025AZI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045FNI-S412">
        <compile   define="CY8C4045FNI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045LQI-S411">
        <compile   define="CY8C4045LQI_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045LQI-S412">
        <compile   define="CY8C4045LQI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045AZI-S413">
        <compile   define="CY8C4045AZI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQI-S403">
        <compile   define="CY8C4024LQI_S403" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQI-S413">
        <compile   define="CY8C4024LQI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQA-S411">
        <compile   define="CY8C4024LQA_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024PVA-S411">
        <compile   define="CY8C4024PVA_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024PVA-S412">
        <compile   define="CY8C4024PVA_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQA-S411">
        <compile   define="CY8C4025LQA_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025PVA-S411">
        <compile   define="CY8C4025PVA_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025PVA-S412">
        <compile   define="CY8C4025PVA_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
