Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4045LQA-S411">
        <compile   define="CY8C4045LQA_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045PVA-S411">
        <compile   define="CY8C4045PVA_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045PVA-S412">
        <compile   define="CY8C4045PVA_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024LQS-S411">
        <compile   define="CY8C4024LQS_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024PVS-S411">
        <compile   define="CY8C4024PVS_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024PVS-S412">
        <compile   define="CY8C4024PVS_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQS-S411">
        <compile   define="CY8C4025LQS_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025PVS-S411">
        <compile   define="CY8C4025PVS_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025PVS-S412">
        <compile   define="CY8C4025PVS_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045LQS-S411">
        <compile   define="CY8C4045LQS_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045PVS-S411">
        <compile   define="CY8C4045PVS_S411" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045PVS-S412">
        <compile   define="CY8C4045PVS_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024AXI-S402">
        <compile   define="CY8C4024AXI_S402" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4024AXI-S412">
        <compile   define="CY8C4024AXI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x800" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000000" RAMsize="0x0800" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025AXI-S402">
        <compile   define="CY8C4025AXI_S402" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025AXI-S412">
        <compile   define="CY8C4025AXI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045AXI-S412">
        <compile   define="CY8C4045AXI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQI-S403">
        <compile   define="CY8C4025LQI_S403" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025LQI-S413">
        <compile   define="CY8C4025LQI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4045LQI-S413">
        <compile   define="CY8C4045LQI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4025AZQ-S403">
        <compile   define="CY8C4025AZQ_S403" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4000s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
