Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4124AZI-S433">
        <compile   define="CY8C4124AZI_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125FNI-S423">
        <compile   define="CY8C4125FNI_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQI-S422">
        <compile   define="CY8C4125LQI_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQI-S423">
        <compile   define="CY8C4125LQI_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125AZI-S423">
        <compile   define="CY8C4125AZI_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125FNI-S413">
        <compile   define="CY8C4125FNI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQI-S412">
        <compile   define="CY8C4125LQI_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQI-S413">
        <compile   define="CY8C4125LQI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125AZI-S413">
        <compile   define="CY8C4125AZI_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125FNI-S433">
        <compile   define="CY8C4125FNI_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQI-S432">
        <compile   define="CY8C4125LQI_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQI-S433">
        <compile   define="CY8C4125LQI_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
