Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4124PVA-S432">
        <compile   define="CY8C4124PVA_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQA-S423">
        <compile   define="CY8C4124LQA_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQA-S433">
        <compile   define="CY8C4124LQA_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVA-S412">
        <compile   define="CY8C4125PVA_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQA-S413">
        <compile   define="CY8C4125LQA_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVA-S432">
        <compile   define="CY8C4125PVA_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQA-S433">
        <compile   define="CY8C4125LQA_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146PVA-S422">
        <compile   define="CY8C4146PVA_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146PVA-S432">
        <compile   define="CY8C4146PVA_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQA-S433">
        <compile   define="CY8C4146LQA_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVS-S412">
        <compile   define="CY8C4124PVS_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQS-S413">
        <compile   define="CY8C4124LQS_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVS-S432">
        <compile   define="CY8C4124PVS_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQS-S433">
        <compile   define="CY8C4124LQS_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVS-S412">
        <compile   define="CY8C4125PVS_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQS-S413">
        <compile   define="CY8C4125LQS_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVS-S432">
        <compile   define="CY8C4125PVS_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQS-S433">
        <compile   define="CY8C4125LQS_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146PVS-S422">
        <compile   define="CY8C4146PVS_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146PVS-S432">
        <compile   define="CY8C4146PVS_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S433">
        <compile   define="CY8C4146LQS_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVE-S412">
        <compile   define="CY8C4124PVE_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQE-S413">
        <compile   define="CY8C4124LQE_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVE-S432">
        <compile   define="CY8C4124PVE_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQE-S433">
        <compile   define="CY8C4124LQE_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVE-S412">
        <compile   define="CY8C4125PVE_S412" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQE-S413">
        <compile   define="CY8C4125LQE_S413" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVE-S432">
        <compile   define="CY8C4125PVE_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQE-S433">
        <compile   define="CY8C4125LQE_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146PVE-S422">
        <compile   define="CY8C4146PVE_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146PVE-S432">
        <compile   define="CY8C4146PVE_S432" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S433">
        <compile   define="CY8C4146LQE_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVA-S422">
        <compile   define="CY8C4124PVA_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVA-S422">
        <compile   define="CY8C4125PVA_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVS-S422">
        <compile   define="CY8C4124PVS_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVS-S422">
        <compile   define="CY8C4125PVS_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124PVE-S422">
        <compile   define="CY8C4124PVE_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125PVE-S422">
        <compile   define="CY8C4125PVE_S422" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQA-S423">
        <compile   define="CY8C4125LQA_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
