Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4146LQA-S423">
        <compile   define="CY8C4146LQA_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQS-S423">
        <compile   define="CY8C4124LQS_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQS-S423">
        <compile   define="CY8C4125LQS_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S423">
        <compile   define="CY8C4146LQS_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4124LQE-S423">
        <compile   define="CY8C4124LQE_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x4000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x4000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125LQE-S423">
        <compile   define="CY8C4125LQE_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S423">
        <compile   define="CY8C4146LQE_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4126AZQ-S423">
        <compile   define="CY8C4126AZQ_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4126AZQ-S433">
        <compile   define="CY8C4126AZQ_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZQ-S423">
        <compile   define="CY8C4146AZQ_S423" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZQ-S433">
        <compile   define="CY8C4146AZQ_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4125AZQ-S433">
        <compile   define="CY8C4125AZQ_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4145AZQ-S433">
        <compile   define="CY8C4145AZQ_S433" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100s.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x1000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x8000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x8000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
