Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4146AZA-S265">
        <compile   define="CY8C4146AZA_S265" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZA-S275">
        <compile   define="CY8C4146AZA_S275" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZA-S245">
        <compile   define="CY8C4147AZA_S245" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZA-S255">
        <compile   define="CY8C4147AZA_S255" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZA-S265">
        <compile   define="CY8C4147AZA_S265" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZA-S275">
        <compile   define="CY8C4147AZA_S275" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZA-S285">
        <compile   define="CY8C4147AZA_S285" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZA-S295">
        <compile   define="CY8C4147AZA_S295" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZS-S245">
        <compile   define="CY8C4146AZS_S245" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZS-S255">
        <compile   define="CY8C4146AZS_S255" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZS-S265">
        <compile   define="CY8C4146AZS_S265" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146AZS-S275">
        <compile   define="CY8C4146AZS_S275" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZS-S245">
        <compile   define="CY8C4147AZS_S245" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
