Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4146AZE-S455">
        <compile   define="CY8C4146AZE_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4127AZE-S445">
        <compile   define="CY8C4127AZE_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4127AZE-S455">
        <compile   define="CY8C4127AZE_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S245">
        <compile   define="CY8C4147AZE_S245" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S255">
        <compile   define="CY8C4147AZE_S255" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S265">
        <compile   define="CY8C4147AZE_S265" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S275">
        <compile   define="CY8C4147AZE_S275" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S285">
        <compile   define="CY8C4147AZE_S285" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S295">
        <compile   define="CY8C4147AZE_S295" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S445">
        <compile   define="CY8C4147AZE_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S455">
        <compile   define="CY8C4147AZE_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S465">
        <compile   define="CY8C4147AZE_S465" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147AZE-S475">
        <compile   define="CY8C4147AZE_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4126LQA-S453">
        <compile   define="CY8C4126LQA_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
