Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4147LQA-S443">
        <compile   define="CY8C4147LQA_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQA-S453">
        <compile   define="CY8C4147LQA_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQA-S463">
        <compile   define="CY8C4147LQA_S463" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQA-S473">
        <compile   define="CY8C4147LQA_S473" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4126LQS-S453">
        <compile   define="CY8C4126LQS_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S243">
        <compile   define="CY8C4146LQS_S243" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S253">
        <compile   define="CY8C4146LQS_S253" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S263">
        <compile   define="CY8C4146LQS_S263" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S273">
        <compile   define="CY8C4146LQS_S273" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQS-S453">
        <compile   define="CY8C4146LQS_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4127LQS-S443">
        <compile   define="CY8C4127LQS_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4127LQS-S453">
        <compile   define="CY8C4127LQS_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S243">
        <compile   define="CY8C4147LQS_S243" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S253">
        <compile   define="CY8C4147LQS_S253" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S263">
        <compile   define="CY8C4147LQS_S263" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
