Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4147LQS-S273">
        <compile   define="CY8C4147LQS_S273" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S283">
        <compile   define="CY8C4147LQS_S283" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S293">
        <compile   define="CY8C4147LQS_S293" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S443">
        <compile   define="CY8C4147LQS_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S453">
        <compile   define="CY8C4147LQS_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S463">
        <compile   define="CY8C4147LQS_S463" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQS-S473">
        <compile   define="CY8C4147LQS_S473" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4126LQE-S453">
        <compile   define="CY8C4126LQE_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S243">
        <compile   define="CY8C4146LQE_S243" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S253">
        <compile   define="CY8C4146LQE_S253" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S263">
        <compile   define="CY8C4146LQE_S263" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S273">
        <compile   define="CY8C4146LQE_S273" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4146LQE-S453">
        <compile   define="CY8C4146LQE_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x2000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4127LQE-S443">
        <compile   define="CY8C4127LQE_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4127LQE-S453">
        <compile   define="CY8C4127LQE_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S243">
        <compile   define="CY8C4147LQE_S243" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S253">
        <compile   define="CY8C4147LQE_S253" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S263">
        <compile   define="CY8C4147LQE_S263" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
