Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4147LQE-S273">
        <compile   define="CY8C4147LQE_S273" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S283">
        <compile   define="CY8C4147LQE_S283" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S293">
        <compile   define="CY8C4147LQE_S293" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S443">
        <compile   define="CY8C4147LQE_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S453">
        <compile   define="CY8C4147LQE_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S463">
        <compile   define="CY8C4147LQE_S463" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4147LQE-S473">
        <compile   define="CY8C4147LQE_S473" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4128AZI-S443">
        <compile   define="CY8C4128AZI_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4128AZI-S445">
        <compile   define="CY8C4128AZI_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4128AXI-S445">
        <compile   define="CY8C4128AXI_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4128AZI-S453">
        <compile   define="CY8C4128AZI_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4128AZI-S455">
        <compile   define="CY8C4128AZI_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4128AXI-S455">
        <compile   define="CY8C4128AXI_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZI-S443">
        <compile   define="CY8C4148AZI_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
