Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4148AZI-S445">
        <compile   define="CY8C4148AZI_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AXI-S445">
        <compile   define="CY8C4148AXI_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZI-S453">
        <compile   define="CY8C4148AZI_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZI-S455">
        <compile   define="CY8C4148AZI_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AXI-S455">
        <compile   define="CY8C4148AXI_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZQ-S443">
        <compile   define="CY8C4148AZQ_S443" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZQ-S445">
        <compile   define="CY8C4148AZQ_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AXQ-S445">
        <compile   define="CY8C4148AXQ_S445" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZQ-S453">
        <compile   define="CY8C4148AZQ_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AZQ-S455">
        <compile   define="CY8C4148AZQ_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4148AXQ-S455">
        <compile   define="CY8C4148AXQ_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
    </family>
    <family Dfamily="PSoC 4500S" Dvendor="Cypress:19">
      <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="48000000" />
      <description>
        PSoC 4500S devices.
      </description>
      <book name="README.txt" title="Cypress PSoC 4 DFP user guide"/>
      <device Dname="CY8C4546AZI-S473">
        <compile   define="CY8C4546AZI_S473" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4546AZI-S475">
        <compile   define="CY8C4546AZI_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
