Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4546AXI-S475">
        <compile   define="CY8C4546AXI_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x10000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x10000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZI-S453">
        <compile   define="CY8C4547AZI_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZI-S455">
        <compile   define="CY8C4547AZI_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZI-S463">
        <compile   define="CY8C4547AZI_S463" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZI-S465">
        <compile   define="CY8C4547AZI_S465" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZI-S473">
        <compile   define="CY8C4547AZI_S473" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZI-S475">
        <compile   define="CY8C4547AZI_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AXI-S475">
        <compile   define="CY8C4547AXI_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AZI-S475">
        <compile   define="CY8C4548AZI_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AXI-S475">
        <compile   define="CY8C4548AXI_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AZI-S483">
        <compile   define="CY8C4548AZI_S483" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AZI-S485">
        <compile   define="CY8C4548AZI_S485" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
