Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
      <device Dname="CY8C4548AXI-S485">
        <compile   define="CY8C4548AXI_S485" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZQ-S453">
        <compile   define="CY8C4547AZQ_S453" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZQ-S455">
        <compile   define="CY8C4547AZQ_S455" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZQ-S473">
        <compile   define="CY8C4547AZQ_S473" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AZQ-S475">
        <compile   define="CY8C4547AZQ_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4547AXQ-S475">
        <compile   define="CY8C4547AXQ_S475" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x20000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x20000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AZQ-S483">
        <compile   define="CY8C4548AZQ_S483" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AZQ-S485">
        <compile   define="CY8C4548AZQ_S485" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
      <device Dname="CY8C4548AXQ-S485">
        <compile   define="CY8C4548AXQ_S485" />
        <debug     Pname="Cortex-M0p" svd="SVD/psoc4100sp256kb.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x20000000" size="0x8000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x00000000" size="0x40000" default="1" startup="1"/>
        <algorithm name="Flash/CY8C4xxx.FLM" start="0x0" size="0x40000" RAMstart="0x20000300" RAMsize="0x0D00" default ="1" style="Keil"/>
      </device>
    </family>
  </devices>

  <conditions>
    <condition id="PSoC 4000S">
      <description>PSoC 4000S devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C4024FNI-S402"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQI-S401"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQI-S402"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024AZI-S403"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024FNI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQI-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024AZI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025FNI-S402"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQI-S401"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQI-S402"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025AZI-S403"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025FNI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQI-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025AZI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045FNI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045LQI-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045LQI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045AZI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQI-S403"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQA-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024PVA-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024PVA-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQA-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025PVA-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025PVA-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045LQA-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045PVA-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045PVA-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024LQS-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024PVS-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024PVS-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQS-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025PVS-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025PVS-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045LQS-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045PVS-S411"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045PVS-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024AXI-S402"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024AXI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025AXI-S402"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025AXI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045AXI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQI-S403"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025LQI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045LQI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025AZQ-S403"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4024AZQ-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4025AZQ-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4045AZQ-S413"/>
    </condition>
    <condition id="PSoC 4100S">
      <description>PSoC 4100S devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C4124FNI-S403"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124FNI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124AZI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124FNI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQI-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124AZI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125FNI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQI-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125AZI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125FNI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQI-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125AZI-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125FNI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQI-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125AZI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146FNI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQI-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146FNI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQI-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125AXI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125AXI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AXI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AXI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4145AZI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4145AXI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4145AXI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXI-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXI-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVA-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQA-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVA-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQA-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQA-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVA-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQA-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVA-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQA-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146PVA-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146PVA-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVS-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQS-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVS-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQS-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVS-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQS-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVS-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQS-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146PVS-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146PVS-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVE-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQE-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVE-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQE-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVE-S412"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQE-S413"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVE-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQE-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146PVE-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146PVE-S432"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVA-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVA-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVS-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVS-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124PVE-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125PVE-S422"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQA-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQS-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQS-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4124LQE-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125LQE-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZQ-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZQ-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZQ-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZQ-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4125AZQ-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4145AZQ-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4145AXQ-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AXQ-S433"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXQ-S423"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXQ-S433"/>
    </condition>
