Infineon/cmsis-packs/PSoC4_DFP/Cypress.PSoC4_DFP.pdsc
    <condition id="PSoC 4100S Plus">
      <description>PSoC 4100S Plus devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AXI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AXI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AXI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AXI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AXI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AXI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AXI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AXI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AXI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AXI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AXI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AXI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AXI-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AXI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZA-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZA-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZA-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZA-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZS-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZS-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZS-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZS-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZA-S245"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZA-S255"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZA-S265"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZA-S275"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S245"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S255"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S265"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S275"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S285"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZA-S295"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZS-S245"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZS-S255"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZS-S265"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZS-S275"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S245"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S255"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S265"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S275"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S285"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZS-S295"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZI-S463"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZI-S463"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZQ-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZQ-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZQ-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZQ-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZQ-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZQ-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZQ-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZQ-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126AZE-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZE-S245"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZE-S255"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZE-S265"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZE-S275"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146AZE-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZE-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127AZE-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S245"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S255"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S265"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S275"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S285"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S295"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147AZE-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126LQA-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S243"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S253"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S263"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S273"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQA-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127LQA-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127LQA-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S243"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S253"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S263"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S273"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S283"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S293"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S463"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQA-S473"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126LQS-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S243"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S253"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S263"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S273"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQS-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127LQS-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127LQS-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S243"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S253"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S263"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S273"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S283"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S293"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S463"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQS-S473"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4126LQE-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S243"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S253"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S263"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S273"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4146LQE-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127LQE-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4127LQE-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S243"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S253"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S263"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S273"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S283"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S293"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S463"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4147LQE-S473"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4128AZI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4128AZI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4128AXI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4128AZI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4128AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4128AXI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZI-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AXI-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AXI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZQ-S443"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZQ-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AXQ-S445"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZQ-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AZQ-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4148AXQ-S455"/>
    </condition>
    <condition id="PSoC 4500S">
      <description>PSoC 4500S devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C4546AZI-S473"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4546AZI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4546AXI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-S463"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-S465"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-S473"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AXI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AZI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AXI-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AZI-S483"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AZI-S485"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AXI-S485"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZQ-S453"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZQ-S455"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZQ-S473"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AZQ-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4547AXQ-S475"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AZQ-S483"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AZQ-S485"/>
      <accept Dvendor="Cypress:19" Dname="CY8C4548AXQ-S485"/>
    </condition>
    <condition id="PSoC 4">
      <description>PSoC 4 devices</description>
      <accept condition="PSoC 4000S"/>
      <accept condition="PSoC 4100S"/>
      <accept condition="PSoC 4100S Plus"/>
      <accept condition="PSoC 4500S"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PSoC 4">
      <!-- This is a dummy startup implementation that emits a compiler error once
           this software component is enabled in the CMSIS RTE project configuration.
           It exists to silence PackChk WARNING M350: No 'Startup' component found.
           Refer to README.txt in the pack root directory for the guidance on the
           intended use of this CSMIS pack. -->
      <description>Dummy startup component, do not use</description>
      <files>
        <file category="doc" name="README.txt"/>
        <file category="source" name="Device/Source/startup_error.c" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
